'number' + 3 + 3 // numbar33 -> все додається до стрінгу
null + 3 // 3 -> null - відсутність значення + 3 = 3
5 && "qwerty" // 5"qwerty" -> 5 і string // 'qwerty'
+'40' + +'2' + "hillel"; // NaN -> '42hillel' ((
'10' - 5 === 6; // false - перетворює 10 на число і виходить що 5 != 6 -> false
true + false // 1 бо true це 1 а false це 0->  1 
'4px' - 3 // NaN  не зможе літери перевести в числа-> NaN
'4' - 3 // 1 по прикладу вище "-" приведе число в рядку до числа ->
'6' + 3 ** 0; // 63 * 0 = 0 -> '61' тут не догнав бо трохи з матиматикою туго "**"
12 / '6'// NaN 12 не поділиться на рядок -> 2 (Тепер зрозуміло що окрім + все приводит до числа)
'10' + (5 === 6); //'10false' 5!=6 false і плюсується до рядка -> '10false'
null == ''// false null!=string -> false
3 ** (9 / 3); // (3*3*3 = 23) тут я з минулого прикладу почитав що це таке "**" 
!!'false' == !!'true' // true (!! переводить до boolean) ну і в цьому випадку js шукає істину -> true
0 || '0' && 1// 01 тут не зрозумів -> 1
(+null == false) < 1; // помилка -> fasle (Почитав)
false && true || true // тут з минулого вже знаю && повертає перше false значення ну || поверне перше true значення ->true
false && (false || true);// false ->
(+null == false) < 1 ** 5; // false ** 5 = 0 (false приведеться до 0) -> false (заплутало мене це **)

//P.S Потрібно ще повторити все це